#Домашнее задание по уроку "Распаковка позиционных параметров".
# Цель задания: Освоить создание функций с параметрами по умолчанию
# и практику вызова этих функций с различным количеством аргументов.
# Задача "Распаковка":
from operator import truediv

print('# 1.Функция с параметрами по умолчанию:')
# Создайте функцию print_params(a = 1, b = 'строка', c = True),
# которая принимает три параметра со значениями по умолчанию
# (например сейчас это: 1, 'строка', True).
# Функция должна выводить эти параметры.
def print_params(a = 1, b = 'строка', c = True):
    print(a, b, c)
# Вызовите функцию print_params с разным количеством аргументов, включая вызов без аргументов.
# Проверьте, работают ли вызовы print_params(b = 25) print_params(c = [1,2,3])
print_params(b = 25)
print_params(c = [1,2,3])
print()

print('# 2.Распаковка параметров:')
# Создайте список values_list с тремя элементами разных типов.
values_list = ['text', 1.3, 99]
# Создайте словарь values_dict с тремя ключами, соответствующими параметрам
# функции print_params, и значениями разных типов.
values_dict = {'a': 5.5, 'b': True, 'c': 'tmp'}
# Передайте values_list и values_dict в функцию print_params,
# используя распаковку параметров (* для списка и ** для словаря).
print_params(*values_list)
print_params(**values_dict)

print()
print ('# 3.Распаковка + отдельные параметры:')
# Создайте список values_list_2 с двумя элементами разных типов
values_list_2 = [True, -5]
# Проверьте, работает ли print_params(*values_list_2, 42)
print_params(*values_list_2, 42)